/**
 * Date-extensions locale Arabic (Lybia) [ar-ly]
 */
Date.prototype.monthNames = ['يناير','فبراير','مارس','أبريل','مايو','يونيو','يوليو','أغسطس','سبتمبر','أكتوبر','نوفمبر','ديسمبر'];
Date.prototype.monthShortNames = ['يناير','فبراير','مارس','أبريل','مايو','يونيو','يوليو','أغسطس','سبتمبر','أكتوبر','نوفمبر','ديسمبر'];
Date.prototype.dayNames = ['الأحد','الإثنين','الثلاثاء','الأربعاء','الخميس','الجمعة','السبت'];
Date.prototype.dayShortNames = ['أحد','إثنين','ثلاثاء','أربعاء','خميس','جمعة','سبت'];