/**
 * Date-extensions locale Nepalese [ne]
 */
Date.prototype.monthNames = ['जनवरी','फेब्रुवरी','मार्च','अप्रिल','मई','जुन','जुलाई','अगष्ट','सेप्टेम्बर','अक्टोबर','नोभेम्बर','डिसेम्बर'];
Date.prototype.monthShortNames = ['जन.','फेब्रु.','मार्च','अप्रि.','मई','जुन','जुलाई.','अग.','सेप्ट.','अक्टो.','नोभे.','डिसे.'];
Date.prototype.dayNames = ['आइतबार','सोमबार','मङ्गलबार','बुधबार','बिहिबार','शुक्रबार','शनिबार'];
Date.prototype.dayShortNames = ['आइत.','सोम.','मङ्गल.','बुध.','बिहि.','शुक्र.','शनि.'];