/**
 * Date-extensions locale Central Atlas Tamazight [tzm]
 */
Date.prototype.monthNames = ['ⵉⵏⵏⴰⵢⵔ','ⴱⵕⴰⵢⵕ','ⵎⴰⵕⵚ','ⵉⴱⵔⵉⵔ','ⵎⴰⵢⵢⵓ','ⵢⵓⵏⵢⵓ','ⵢⵓⵍⵢⵓⵣ','ⵖⵓⵛⵜ','ⵛⵓⵜⴰⵏⴱⵉⵔ','ⴽⵟⵓⴱⵕ','ⵏⵓⵡⴰⵏⴱⵉⵔ','ⴷⵓⵊⵏⴱⵉⵔ'];
Date.prototype.monthShortNames = ['ⵉⵏⵏⴰⵢⵔ','ⴱⵕⴰⵢⵕ','ⵎⴰⵕⵚ','ⵉⴱⵔⵉⵔ','ⵎⴰⵢⵢⵓ','ⵢⵓⵏⵢⵓ','ⵢⵓⵍⵢⵓⵣ','ⵖⵓⵛⵜ','ⵛⵓⵜⴰⵏⴱⵉⵔ','ⴽⵟⵓⴱⵕ','ⵏⵓⵡⴰⵏⴱⵉⵔ','ⴷⵓⵊⵏⴱⵉⵔ'];
Date.prototype.dayNames = ['ⴰⵙⴰⵎⴰⵙ','ⴰⵢⵏⴰⵙ','ⴰⵙⵉⵏⴰⵙ','ⴰⴽⵔⴰⵙ','ⴰⴽⵡⴰⵙ','ⴰⵙⵉⵎⵡⴰⵙ','ⴰⵙⵉⴹⵢⴰⵙ'];
Date.prototype.dayShortNames = ['ⴰⵙⴰⵎⴰⵙ','ⴰⵢⵏⴰⵙ','ⴰⵙⵉⵏⴰⵙ','ⴰⴽⵔⴰⵙ','ⴰⴽⵡⴰⵙ','ⴰⵙⵉⵎⵡⴰⵙ','ⴰⵙⵉⴹⵢⴰⵙ'];